{
  "blogs": [
    {
      "title": "Global Food Supply Implications",
      "body": "Herein we investigate the implications on food supply at a global scale and also assess cost fluctuations between the three production scenarios BAU, MLS, and TLS (Figure 5). We find that while the magnitude of food baskets remains the same across the scenarios, total costs of production per tonne and crop commodity is consistently lower in the land sparing scenarios in any given geographical part. With this finding we demonstrate that food demand can be met at a lower cost of production per tonne–a primordial and critical factor to the performance of supply chains (Gold et al., 2017; Validi et al., 2014). We further assess food security implications and investigate costs of energy produced for the 10 crops considered. In this context, food prices were calculated by keeping everything else equal without taking into consideration any dynamic interactions in response to demand or income and employment. Under the present land sparing scenarios, no energy intake loss is due to occur as costs per Mcal produced decrease (Figure 6). This is of essence to the current consensus where studies attempt to enhance global food security through the utilisation of crop-based solutions (Aiking, 2011; Day, 2013; Young and Skrivergaard, 2020). Naturally, as the optimisation spatially reallocated agricultural systems globally, parts of the globe would rely on trade to achieve production inputs sufficiency (fertiliser) along with feed sufficiency – factors that affect food security in far deeper ways than merely yield gaps (Savary et al., 2012), which calls for robust global supply chains to assure resilience and constant food supply (Seekell et al., 2017; Cole et al., 2018; Kinnunen et al., 2020). Interestingly, MLS and TLS supply curves often intersect, indicating which of the two strategies would result in the most economically efficient system at any given simulation unit. The latter signifies the potential value of a crop-specific, spatially targeted integration of land sparing strategy to best facilitate increased food production at the minimal economic and environmental cost.",
      "author": "Prince",
      "id": 1
    },
    {
      "title": "Journey Of The Human Mind",
      "body": "We face a world that is far different from our ancestor’s world. But we have the potential to understand and solve the problems of today, many of which are man-made, if we first understand who we are, and how the past has made us. We must know what is unchanging about human nature, and recognize what we can and must consciously change to ensure the future for ourselves and our planet.\n\nThe Human Journey is the journey of the human mind, how it developed, the world it made and the problems it solved, why and how it solved them; and how those solutions affected its evolution and subsequent decisions.\n\nModern discoveries have shown that qualities that we thought were the unique provenance of our human brain in fact belong to other species as well. Rats will sacrifice food to help other rats, even strangers. Bonobos show altruism and empathy, and a sense of fairness is seen in many animals.\n\nReligion was thought to be the birthplace of morality but morality is now understood to be an innate characteristic in us and other animals. Virtues popularly expounded as providing ‘a ticket to heaven’ are now understood as evolutionary tools through which a necessary ‘selflessness’ is cultivated – a selflessness which enables a more comprehensive understanding to stabilize in the brain. Our spiritual leaders and prophets, although often misunderstood, all spoke of this. Now our neurobiologists and evolutionary psychologists do as well.\n\nThe human brain is flexible. It has enabled us to adapt, survive, and even flourish all over the world. We are the only animals that can do this. But this flexibility has a downside: we are easily manipulated and influenced by the group or culture in which we find ourselves. We are wired to be social animals, to connect beyond our immediate circle, but we too often limit ourselves to thinking in terms of “Us and Them.”\n\nAgain, this has been pointed out by spiritual leaders, thinkers and psychologists, and most succinctly recently by the scholar Idries Shah, for example, in the book Reflections:\n\n“Tolerance and trying to understand others, until recently a luxury, has today become a necessity. This is because: unless we can realize that we and others are generally behaving as we do because of inculcated biases over which we have no control while we imagine that they are our own opinions, we might do something which would bring about the destruction of all of us. Then we will not have any time at all to learn whether tolerance is a good or a bad thing…\n\n“People cannot handle prejudice because they try to deal with the symptom. Prejudice is the symptom, wrong assumptions are the cause. ‘Prejudice is the daughter of assumption.’”\n\n",
      "author": "Cozy",
      "id": 2
    }
  ]
}